       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PG3.
       AUTHOR.     Eric N Parris.
      **********************************************************
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      *
      * 
      * 
      * 
      * 
      * 
      * 
      *
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      *
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      * 
      *
      ********************************************************** 
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.    IBMPC.
       OBJECT-COMPUTER.    IBMPC.

       INPUT-OUTPUT SECTION.
      * Assign input and output files in order to bring in data and output report
       FILE-CONTROL.
              SELECT STOCK-RECORDS-FILE-1
			  ASSIGN TO 'PR3AF14.TXT'
			  ORGANIZATION IS LINE SEQUENTIAL.
			  
              SELECT STOCK-RECORDS-FILE-2
			  ASSIGN TO 'PR3BF14.TXT'
			  ORGANIZATION IS LINE SEQUENTIAL.

              SELECT SORTED-STOCK-1
			  ASSIGN TO 'SORTEDSTOCK1.TXT'
			  ORGANIZATION IS LINE SEQUENTIAL.
			  
              SELECT SORTED-STOCK-2
			  ASSIGN TO 'SORTEDSTOCK2.TXT'
			  ORGANIZATION IS LINE SEQUENTIAL.

              SELECT MERGED-STOCK-FILE
			  ASSIGN TO 'MERGEDSTOCKFILE.TXT'
			  ORGANIZATION IS LINE SEQUENTIAL.
			  
			  SELECT STOCK-REPORT-FILE
			  ASSIGN TO 'STOCKREPORTFILE.TXT'
			  ORGANIZATION IS LINE SEQUENTIAL.
			  
			  
			  SELECT SORT-FILE
			  ASSIGN TO PRINTER "SORT.TMP".
       DATA DIVISION.
       FILE SECTION.


      * Describe oontents of files
	   FD    STOCK-RECORDS-FILE-1
		   RECORD CONTAINS 122 CHARACTERS.
	   01 FILE-1-RECORD.
		   05 UR1-INVESTOR-ID PIC XX.
		   05 FILLER PIC X(120).
		   
	   FD    STOCK-RECORDS-FILE-2
		   RECORD CONTAINS 122 CHARACTERS.
	   01 FILE-2-RECORD.
		   05 UR2-INVESTOR-ID PIC XX.
		   05 FILLER PIC X(120).
		   
       FD SORTED-STOCK-1
           RECORD CONTAINS 122 CHARACTERS.
      *
       01  STOCK-RECORD1.
           05  SR1-INVESTOR-ID                    PIC X(2).
           05  FILLER                         PIC X(120).
       FD SORTED-STOCK-2
           RECORD CONTAINS 122 CHARACTERS.
      *
       01  STOCK-RECORD2.
           05  SR2-INVESTOR-ID                    PIC X(2).
           05  FILLER                         PIC X(120).
		   
       FD    MERGED-STOCK-FILE
	       RECORD CONTAINS 122 CHARACTERS.
       01    STOCK-RECORDS.
	       05 INVESTOR-ID                   PIC XX.
		   05 INVESTOR-NAME                 PIC XXXXX.
		   05 INVESTOR-RATING               PIC 9.
		   05 STOCK-DATA OCCURS 6 TIMES.
		       10 STOCK-SYMBOL                 PIC X(5).
		       10 EXCHANGE               PIC X.
			   10 NUMBER-OF-SHARES PIC S9999.
			   10 PRICE-PER-SHARE   PIC S999V99.
			   10 YEAR-BOUGHT       PIC 9(4).
			   
       SD SORT-FILE
           RECORD CONTAINS 122 CHARACTERS.
       01  SORT-RECORD.
           05  S-INVESTOR-ID                    PIC X(2).
           05  FILLER                         PIC X(120).

       FD    STOCK-REPORT-FILE.
       01    STOCK-OUTPUT.
           05 STOCK-REPORT       PIC X(80).

       WORKING-STORAGE SECTION.
       01    WS-WORK-AREAS.
             05    ARE-THERE-MORE-RECORDS    PIC X(3) VALUE 'YES'.
             05    ARE-THERE-MORE-ARRAYS    PIC X(3) VALUE 'YES'.


      *DECLARE ANY VARIABLES IN THIS AREA.
      * SECOND header line of report file		   
	   01 HEADER-LINE-1.
		   05 FILLER PIC x(24).
		   05        PIC X(14) VALUE 
				'STOCK ANALYSIS'.
		   05 FILLER PIC X(16).
		   05        PIC X(3) VALUE 'ENP'.
		   05 FILLER PIC X(23).
	   01 HEADER-LINE-2.
		   05 FILLER PIC X(23).
		   05 BEGINNING-YEAR PIC 9999.
		   05      PIC X(11) VALUE
				' TO PRESENT'.
		   05 FILLER PIC X(42).
	   01 INVESTOR-ID-LINE.
		   05   PIC X(6) VALUE '  ID: '.
		   05   INVESTOR-ID-OUT PIC XX.
		   05   FILLER PIC X(72).
	   01 INVESTOR-NAME-LINE.
		   05    PIC X(6) VALUE 'NAME: '.
		   05   INVESTOR-NAME-OUT PIC X(5).
		   05 FILLER PIC X(69).
	   01 INVESTOR-HEADER-1.
		   05 FILLER PIC X(21).
		   05    PIC X(4) VALUE 'YEAR'.
		   05 FILLER PIC XXX.
		   05    PIC X(6) VALUE 'NUM OF'.
		   05 FILLER PIC XX.
		   05    PIC X(5) VALUE 'PRICE'.
		   05 FILLER PIC X(5).
		   05   PIC X(8) VALUE 'ORIGINAL'.
		   05 FILLER PIC X(26).
	   01 INVESTOR-HEADER-2.
		   05 FILLER PIC XX.
		   05   PIC X(6) VALUE 'SYMBOL'.
		   05 FILLER PIC XX.
		   05   PIC X(8) VALUE 'EXCHANGE'.
		   05 FILLER PIC XX.
		   05   PIC X(6) VALUE 'BOUGHT'.
		   05 FILLER PIC XX.
		   05   PIC X(6) VALUE 'SHARES'.
		   05 FILLER PIC XX.
		   05   PIC X(6) VALUE 'PER SH'.
		   05 FILLER PIC XXX.
		   05   PIC X(11) VALUE 'STOCK VALUE'.
		   05 FILLER PIC X(24).
	   01 INVESTOR-OUTPUT-LINE.
		   05 FILLER PIC XX.
		   05 INVESTOR-SYMBOL-OUT PIC X(5).
		   05 FILLER PIC XXXX.
		   05 INVESTOR-EXCHANGE-OUT PIC X(6).
		   05 FILLER PIC XXXX.
		   05 INVESTOR-YEAR-PURCHASED PIC 9(4).
		   05 FILLER PIC XXX.
		   05 NUM-OF-SHARES-OUT PIC Z,ZZ9.
		   05 FILLER PIC XXX.
		   05 PRICE-PER-SHARE-OUT PIC ZZ9.99.
		   05 FILLER PIC XX.
		   05 ORIGINAL-STOCK-VALUE-OUT PIC Z,ZZZ,ZZ9.99.
		   05 FILLER PIC X(24).
	   01 INVESTOR-TOTAL-LINE.
		   05   PIC X(11) VALUE '  RATING:  '.
		   05 INVESTOR-RATING-OUT PIC X(10).
		   05 FILLER PIC X(15).
		   05   PIC X(6) VALUE 'TOTAL '.
		   05 INVESTOR-TOTAL-VALUE-OUT PIC $$$,$$$,$$9.99.
		   05 FILLER PIC X(24).
	   01 REGION-TOTAL-LINE.
		   05 FILLER PIC X(19).
		   05   PIC X(19) VALUE 'TOTAL FOR REGION:  '.
		   05 REGION-TOTAL-OUT PIC $$$,$$$,$$$,$$9.99.
		   05 FILLER PIC X(24).
	   01 GRAND-TOTAL-LINE.
		   05 FILLER PIC X(17).
		   05   PIC X(17) VALUE 'GRAND TOTAL:     '.
		   05  GRAND-TOTAL-OUT PIC $$$,$$$,$$$,$$$,$$9.99.
		   05 FILLER PIC X(24).
      * Variables used for calculations		   
	   01 WORKING-DATA.
		   05 ORIGINAL-STOCK-VALUE PIC 9999999V99.
		   05 STOCK-VALUE-INVESTOR PIC 999999999V99.
		   05 STOCK-VALUE-REGION PIC 999999999999V99.
		   05 STOCK-VALUE-TOTAL PIC 9(15)V99.
		   05 INVESTOR-RATING-HOLDER PIC X(10).
	   01 INVESTOR-RATING-DESCRIPT.
		   05 FILLER PIC X(11) VALUE '1AGGRESSIVE'.
		   05 FILLER PIC X(11) VALUE '2ACTIVE'.
		   05 FILLER PIC X(11) VALUE '3MODERATE'.
		   05 FILLER PIC X(11) VALUE '4INACTIVE'.
	   01 INVESTOR-RATING-TABLE REDEFINES INVESTOR-RATING-DESCRIPT.
		   05 INVESTOR-RATINGS OCCURS 4 TIMES
			INDEXED BY INVESTOR-INDEX PIC 9.
			   10 TYPE-NUMBER  PIC 9.
			   10 TYPE-NAME PIC X(10).
	   01 FLAGS-AND-SUBSCRIPTS.
		   05 SUB PIC 9.
		   05 VALID-YEAR PIC X VALUE 'N'.
       PROCEDURE DIVISION.

       100-MAIN-MODULE.
		   PERFORM 135-SORT-AND-MERGE-ROUTINE
		   PERFORM 125-HOUSEKEEPING
		   PERFORM 150-FORMATTING-HEADER
		   PERFORM 200-READ-RECORDS
		   PERFORM 250-CLOSE-ROUTINE

           .



       125-HOUSEKEEPING.
           OPEN    OUTPUT    STOCK-REPORT-FILE
				   INPUT     MERGED-STOCK-FILE
           .
	   135-SORT-AND-MERGE-ROUTINE.
		   SORT SORT-FILE
		    ON ASCENDING KEY S-INVESTOR-ID
			USING STOCK-RECORDS-FILE-1
			GIVING SORTED-STOCK-1
		   SORT SORT-FILE
		    ON ASCENDING KEY S-INVESTOR-ID
			USING STOCK-RECORDS-FILE-2
			GIVING SORTED-STOCK-2
		   MERGE SORT-FILE
		    ON ASCENDING KEY S-INVESTOR-ID
			USING SORTED-STOCK-1, SORTED-STOCK-2
			GIVING MERGED-STOCK-FILE
           .
      * Write header to report
       150-FORMATTING-HEADER.
           PERFORM UNTIL VALID-YEAR = 'Y'
			IF INPUT-YEAR > 2009 AND < 2015
				MOVE "Y" TO VALID-INPUT
				ELSE
				DISPLAY " PLEASE ENTER A YEAR"
				ACCEPT INPUT-YEAR
			END-IF
           END-PERFORM
			 WRITE STOCK-OUTPUT FROM HEADER-LINE-1
			 WRITE STOCK-OUTPUT FROM HEADER-LINE-2
           .
       170-GET-INVESTOR-RATING.
		   SET INVESTOR-INDEX TO 1
		   SEARCH INVESTOR-RATING-TABLE
			AT END MOVE STRING 'INVALID' SPACE INVESTOR-RATING
				DELIMITED BY SIZE INTO INVESTOR-RATING-HOLDER
			WHEN INVESTOR-RATING = TYPE-NUMBER(INVESTOR-INDEX)
			 MOVE TYPE-NUMBER(INVESTOR-INDEX) TO INVESTOR-RATING-HOLDER
			 CONTINUE
		   END-SEARCH
           .
	   180-CONTROL-BREAK.
		   MOVE STOCK-VALUE-INVESTOR TO INVESTOR-TOTAL-VALUE-OUT
		   ADD STOCK-VALUE-INVESTOR TO STOCK-VALUE-REGION
		   ADD STOCK-VALUE-INVESTOR TO STOCK-VALUE-TOTAL
		   MOVE INVESTOR-RATING-HOLDER TO INVESTOR-RATING-OUT
		   WRITE STOCK-OUTPUT FROM INVESTOR-TOTAL-LINE
		    AFTER ADVANCING 2 LINE
		   MOVE ' ' TO STOCK-OUTPUT
		   WRITE STOCK-OUTPUT AFTER ADVANCING 2 LINE
		   MOVE 0 TO STOCK-VALUE-INVESTOR
		   .
      *Read in records and run process items routine
       200-READ-RECORDS.
             PERFORM UNTIL ARE-THERE-MORE-RECORDS = 'NO'
                  READ MERGED-STOCK-FILE
                      AT END
                          MOVE 'NO' TO ARE-THERE-MORE-RECORDS
                      NOT AT END
                          PERFORM 225-PROCESS-DATA
                  END-READ
              END-PERFORM
           .
	   225-PROCESS-DATA.
			  MOVE INVESTOR-ID TO INVESTOR-ID-OUT
			  WRITE STOCK-OUTPUT FROM INVESTOR-ID-LINE
			    AFTER ADVANCING 1 LINE
			  MOVE INVESTOR-NAME TO INVESTOR-NAME-OUT
			  WRITE STOCK-OUTPUT FROM INVESTOR-NAME-LINE
			    AFTER ADVANCING 1 LINE
			  WRITE STOCK-OUTPUT FROM INVESTOR-HEADER-1
			    AFTER ADVANCING 1 LINE
			  WRITE STOCK-OUTPUT FROM INVESTOR-HEADER-2
			    AFTER ADVANCING 1 LINE
			 PERFORM VARYING SUB FROM 1 BY 1 UNTIL
				   SUB > 6
			  PERFORM 230-VALIDATE-DATA
			  MOVE 'SWAG' TO STOCK-OUTPUT
			  WRITE STOCK-OUTPUT AFTER ADVANCING 1 LINE
			 END-PERFORM
			 PERFORM 180-CONTROL-BREAK
		   .
	   230-VALIDATE-DATA.
		   .
	   235-GRAND-TOTAL-ROUTINE.
			  MOVE STOCK-VALUE-REGION TO REGION-TOTAL-OUT
			  MOVE STOCK-VALUE-TOTAL TO GRAND-TOTAL-OUT
			  WRITE STOCK-OUTPUT FROM REGION-TOTAL-LINE
			    AFTER ADVANCING 2 LINE
			  WRITE STOCK-OUTPUT FROM GRAND-TOTAL-LINE
			    AFTER ADVANCING 2 LINE
		   .
       250-CLOSE-ROUTINE.
			  PERFORM 235-GRAND-TOTAL-ROUTINE
              CLOSE STOCK-REPORT-FILE
				  MERGED-STOCK-FILE
              STOP RUN.
           .